# SetFocusOnItem

## Description
Sets the keyboard input focus on the specified item.

```pascal
PROCEDURE SetFocusOnItem(
				liDialogID    : LONGINT;
				liComponentID : LONGINT);
```

```python

def vs.SetFocusOnItem(liDialogID, liComponentID):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|liDialogID|LONGINT||
|liComponentID|LONGINT||

## Version
Availability: from VectorWorks12.5
## Category
* Dialogs - Modern